title: Suspected Reverse Tunnel
id: 00000000-0000-0000-0000-000000000000
description: This alert detects RDP tunnel network communications to and from a victim workstation.
author: Splunk2Sigma
date: 2024-08-06
tags:
  - attack.t1572
logsource:
  product: windows
  service: security
detection:
  selection:
    EventCode: '5156'
    Source_Port: '3389'
    Destination_Port: '3389'
    Destination_Address:
      - '127.*'
      - '::1'
    Source_Address:
      - '127.*'
      - '::1'
  condition: selection
falsepositives:
  - Unknown
level: high