title: Suspected Reverse Tunnel
id: 6a7e4e83-8a11-4a9e-8b2c-5d2a2d3e4a6e
description: This alert detects RDP tunnel network communications to and from a victim workstation.
author: Splunk2Sigma
date: 01/08/2024
tags:
  - attack.t1572
logsource:
  product: windows
  service: security
detection:
  selection1:
    EventCode: '5156'
    Source_Port: '3389'
    Destination_Address:
      - '127.*'
      - '::1'
  selection2:
    EventCode: '5156'
    Destination_Port: '3389'
    Source_Address:
      - '127.*'
      - '::1'
  condition: selection1 or selection2
fields:
  - Source_Address
  - Source_Port
  - Destination_Address
  - Destination_Port
  - action
  - ComputerName
  - _time
  - Direction
falsepositives:
  - Unknown
level: high
